/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "작업을 완료할 수 없음";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "알 수 없는 오류 발생(%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "동작을 완료할 수 없음";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "나중에 다시 시도하십시오.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "기록할 수 없음";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "기록할 수 없음";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "%@을(를) 사용 중인 다른 동작을 모두 중단하고 다시 시도하십시오."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "기록할 수 없음";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "작업이 중단됨";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "파일 쓰기를 계속하는 데 필요한 여유 공간이 충분하지 않습니다. 기존의 비디오 또는 사진을 삭제하여 공간을 만드십시오.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "이 기록의 최대 길이에 도달했습니다."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "이 기록의 최대 크기에 도달했습니다."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "기록 장비를 사용 중인 다른 동작을 모두 중단하고 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "이 기록의 최대 길이에 도달했습니다."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "기록할 수 없음";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "기록을 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@을(를) 사용할 수 없음"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "%@을(를) 사용 중인 다른 동작을 모두 중단하고 다시 시도하십시오."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@을(를) 사용할 수 없음"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "%@을(를) 사용 중인 다른 동작을 모두 중단하고 다시 시도하십시오."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "기록이 중단됨";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "기록 장비를 사용 중인 다른 동작을 모두 중단하고 다시 시도하십시오.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "동작을 완료할 수 없음";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "나중에 다시 시도하십시오.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "보내기를 완료할 수 없음";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "다시 보내 보십시오.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "디코드할 수 없음";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "미디어 데이터를 디코드할 수 없습니다. 손상되었을 수도 있습니다.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "이 미디어 포맷은 지원되지 않습니다.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "저장할 수 없음";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "다시 저장해 보십시오.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "이 미디어를 사용할 수 없습니다.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "이 미디어를 사용할 수 없습니다.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "이 미디어를 사용할 수 없습니다.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "이 미디어를 사용할 수 없습니다.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "이 미디어 포맷은 지원되지 않습니다.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "이 미디어가 손상되었을 수도 있습니다.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "사진을 찍을 수 없음";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "다시 사진을 찍어 보십시오.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "작업이 중단됨";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "이 작업은 보호된 콘텐츠에 대해 지원되지 않습니다."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "이 콘텐츠는 권한이 없습니다."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "이 응용프로그램은 이 파일을 재생할 수 있는 권한이 없습니다."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "이 미디어를 사용할 수 없습니다.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "디코드할 수 없음";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "이 미디어에 대해 필요한 디코더를 찾을 수 없습니다.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "인코딩할 수 없음";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "이 미디어에 대해 필요한 인코더를 찾을 수 없습니다.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "디코드할 수 없음";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "이 미디어에 대해 필요한 디코더가 사용 중입니다.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "미디어를 디코딩하는 다른 동작을 모두 중단하고 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "인코딩할 수 없음";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "이 미디어에 대해 필요한 인코더가 사용 중입니다.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "미디어를 인코딩하는 다른 동작을 모두 중단하고 다시 시도하십시오.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@을(를) 사용할 수 없음"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "배경에서 실행 중인 응용 프로그램에서 %@을(를) 사용할 수 없습니다."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "작업이 중단됨";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "이 작업은 이 미디어에 대해 지원되지 않습니다.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "작업이 중단됨";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "제공된 설명에 따라 비디오를 만들 수 없습니다.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "열 수 없음";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "이 미디어를 사용할 수 없습니다.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "작업이 중단됨";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "다운로드 대상 URL에 있는 캐시 파일을 사용할 수 없습니다.";
